---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightShapeStyle
source: html/5ac5e53b-c8d1-538d-40ba-7e8a5e936341.htm
---
# Autodesk.Revit.DB.Lighting.LightShapeStyle

Tags for specific light shape styles

## Syntax (C#)
```csharp
public enum LightShapeStyle
```